{
  "11": 3,
  "12": 4,
  "13": 5,
  "25": 6,
  "64": 7,
  "65": 8,
  "66": 9,
  "67": 10,
  "68": 11,
  "69": 12,
  "70": 13,
  "71": 14,
  "72": 15,
  "73": 16,
  "75": 17,
  "76": 18,
  "77": 19,
  "78": 20,
  "79": 21,
  "81": 22,
  "82": 23,
  "83": 24,
  "84": 25,
  "85": 26,
  "87": 27,
  "89": 28,
  "220": 29,
  "258": 30,
  "259": 31,
  "261": 32,
  "263": 33,
  "264": 34,
  "265": 35,
  "266": 36,
  "267": 37,
  "268": 38,
  "269": 39,
  "272": 40,
  "273": 41,
  "274": 42,
  "275": 43,
  "276": 44,
  "277": 45,
  "278": 46,
  "281": 47,
  "282": 48,
  "283": 49,
  "285": 50,
  "287": 51,
  "288": 52,
  "290": 53,
  "291": 54,
  "292": 55,
  "293": 56,
  "294": 57,
  "295": 58,
  "296": 59,
  "297": 60,
  "299": 61,
  "300": 62,
  "301": 63,
  "304": 64,
  "305": 65,
  "306": 66,
  "307": 67,
  "308": 68,
  "309": 69,
  "311": 70,
  "312": 71,
  "315": 72,
  "316": 73,
  "318": 74,
  "320": 75,
  "321": 76,
  "324": 77,
  "325": 78,
  "326": 79,
  "327": 80,
  "329": 81,
  "331": 82,
  "332": 83,
  "336": 84,
  "337": 85,
  "342": 86,
  "343": 87,
  "344": 88,
  "346": 89,
  "348": 90,
  "349": 91,
  "351": 92,
  "354": 93,
  "355": 94,
  "359": 95,
  "360": 96,
  "361": 97,
  "362": 98,
  "370": 99,
  "372": 100,
  "373": 101,
  "374": 102,
  "375": 103,
  "376": 104,
  "380": 105,
  "383": 106,
  "384": 107,
  "385": 108,
  "387": 109,
  "388": 110,
  "390": 111,
  "391": 112,
  "392": 113,
  "395": 114,
  "396": 115,
  "399": 116,
  "402": 117,
  "403": 118,
  "404": 119,
  "406": 120,
  "408": 121,
  "409": 122,
  "413": 123,
  "414": 124,
  "416": 125,
  "417": 126,
  "424": 127,
  "428": 128,
  "434": 129,
  "436": 130,
  "437": 131,
  "439": 132,
  "442": 133,
  "444": 134,
  "447": 135,
  "450": 136,
  "451": 137,
  "453": 138,
  "454": 139,
  "455": 140,
  "458": 141,
  "459": 142,
  "460": 143,
  "462": 144,
  "466": 145,
  "467": 146,
  "470": 147,
  "478": 148,
  "479": 149,
  "486": 150,
  "490": 151,
  "495": 152,
  "496": 153,
  "501": 154,
  "506": 155,
  "511": 156,
  "513": 157,
  "514": 158,
  "519": 159,
  "520": 160,
  "521": 161,
  "523": 162,
  "525": 163,
  "526": 164,
  "527": 165,
  "531": 166,
  "532": 167,
  "539": 168,
  "541": 169,
  "546": 170,
  "548": 171,
  "550": 172,
  "554": 173,
  "560": 174,
  "561": 175,
  "566": 176,
  "569": 177,
  "575": 178,
  "579": 179,
  "580": 180,
  "581": 181,
  "582": 182,
  "592": 183,
  "593": 184,
  "594": 185,
  "598": 186,
  "603": 187,
  "613": 188,
  "614": 189,
  "618": 190,
  "628": 191,
  "630": 192,
  "631": 193,
  "635": 194,
  "645": 195,
  "649": 196,
  "651": 197,
  "652": 198,
  "655": 199,
  "656": 200,
  "664": 201,
  "665": 202,
  "668": 203,
  "671": 204,
  "677": 205,
  "685": 206,
  "687": 207,
  "688": 208,
  "689": 209,
  "708": 210,
  "710": 211,
  "712": 212,
  "716": 213,
  "729": 214,
  "737": 215,
  "738": 216,
  "743": 217,
  "745": 218,
  "749": 219,
  "754": 220,
  "762": 221,
  "773": 222,
  "778": 223,
  "779": 224,
  "780": 225,
  "781": 226,
  "782": 227,
  "783": 228,
  "784": 229,
  "786": 230,
  "788": 231,
  "802": 232,
  "805": 233,
  "809": 234,
  "822": 235,
  "824": 236,
  "829": 237,
  "831": 238,
  "833": 239,
  "834": 240,
  "838": 241,
  "840": 242,
  "846": 243,
  "864": 244,
  "869": 245,
  "880": 246,
  "884": 247,
  "887": 248,
  "893": 249,
  "896": 250,
  "898": 251,
  "899": 252,
  "901": 253,
  "910": 254,
  "911": 255,
  "912": 256,
  "924": 257,
  "934": 258,
  "936": 259,
  "938": 260,
  "945": 261,
  "951": 262,
  "953": 263,
  "959": 264,
  "961": 265,
  "967": 266,
  "969": 267,
  "971": 268,
  "974": 269,
  "977": 270,
  "978": 271,
  "981": 272,
  "991": 273,
  "992": 274,
  "998": 275,
  "1001": 276,
  "1008": 277,
  "1018": 278,
  "1028": 279,
  "1030": 280,
  "1037": 281,
  "1043": 282,
  "1055": 283,
  "1072": 284,
  "1073": 285,
  "1080": 286,
  "1082": 287,
  "1097": 288,
  "1099": 289,
  "1104": 290,
  "1116": 291,
  "1122": 292,
  "1126": 293,
  "1138": 294,
  "1141": 295,
  "1147": 296,
  "1149": 297,
  "1162": 298,
  "1169": 299,
  "1171": 300,
  "1172": 301,
  "1195": 302,
  "1200": 303,
  "1218": 304,
  "1237": 305,
  "1262": 306,
  "1280": 307,
  "1295": 308,
  "1299": 309,
  "1317": 310,
  "1321": 311,
  "1325": 312,
  "1327": 313,
  "1331": 314,
  "1334": 315,
  "1338": 316,
  "1344": 317,
  "1347": 318,
  "1375": 319,
  "1376": 320,
  "1380": 321,
  "1386": 322,
  "1391": 323,
  "1394": 324,
  "1395": 325,
  "1415": 326,
  "1421": 327,
  "1437": 328,
  "1446": 329,
  "1448": 330,
  "1466": 331,
  "1469": 332,
  "1481": 333,
  "1495": 334,
  "1501": 335,
  "1517": 336,
  "1522": 337,
  "1540": 338,
  "1553": 339,
  "1557": 340,
  "1560": 341,
  "1564": 342,
  "1566": 343,
  "1592": 344,
  "1598": 345,
  "1601": 346,
  "1604": 347,
  "1610": 348,
  "1612": 349,
  "1615": 350,
  "1620": 351,
  "1645": 352,
  "1652": 353,
  "1654": 354,
  "1658": 355,
  "1661": 356,
  "1662": 357,
  "1672": 358,
  "1675": 359,
  "1677": 360,
  "1678": 361,
  "1744": 362,
  "1762": 363,
  "1764": 364,
  "1765": 365,
  "1768": 366,
  "1772": 367,
  "1774": 368,
  "1794": 369,
  "1798": 370,
  "1799": 371,
  "1803": 372,
  "1812": 373,
  "1826": 374,
  "1832": 375,
  "1841": 376,
  "1847": 377,
  "1864": 378,
  "1867": 379,
  "1871": 380,
  "1891": 381,
  "1892": 382,
  "1897": 383,
  "1907": 384,
  "1913": 385,
  "1955": 386,
  "1960": 387,
  "1964": 388,
  "1969": 389,
  "1978": 390,
  "1989": 391,
  "1995": 392,
  "2000": 393,
  "2002": 394,
  "2005": 395,
  "2024": 396,
  "2040": 397,
  "2063": 398,
  "2092": 399,
  "2098": 400,
  "2106": 401,
  "2107": 402,
  "2117": 403,
  "2119": 404,
  "2131": 405,
  "2172": 406,
  "2192": 407,
  "2201": 408,
  "2211": 409,
  "2223": 410,
  "2252": 411,
  "2259": 412,
  "2295": 413,
  "2302": 414,
  "2308": 415,
  "2322": 416,
  "2381": 417,
  "2389": 418,
  "2396": 419,
  "2407": 420,
  "2416": 421,
  "2423": 422,
  "2428": 423,
  "2431": 424,
  "2445": 425,
  "2453": 426,
  "2463": 427,
  "2483": 428,
  "2486": 429,
  "2497": 430,
  "2503": 431,
  "2512": 432,
  "2554": 433,
  "2579": 434,
  "2586": 435,
  "2605": 436,
  "2629": 437,
  "2642": 438,
  "2649": 439,
  "2679": 440,
  "2709": 441,
  "2727": 442,
  "2739": 443,
  "2749": 444,
  "2763": 445,
  "2792": 446,
  "2793": 447,
  "2807": 448,
  "2808": 449,
  "2821": 450,
  "2827": 451,
  "2836": 452,
  "2840": 453,
  "2848": 454,
  "2852": 455,
  "2854": 456,
  "2868": 457,
  "2877": 458,
  "2910": 459,
  "2917": 460,
  "2942": 461,
  "2961": 462,
  "2967": 463,
  "2979": 464,
  "2995": 465,
  "3042": 466,
  "3055": 467,
  "3067": 468,
  "3073": 469,
  "3074": 470,
  "3091": 471,
  "3105": 472,
  "3127": 473,
  "3172": 474,
  "3194": 475,
  "3197": 476,
  "3209": 477,
  "3237": 478,
  "3239": 479,
  "3242": 480,
  "3273": 481,
  "3276": 482,
  "3288": 483,
  "3289": 484,
  "3312": 485,
  "3335": 486,
  "3342": 487,
  "3355": 488,
  "3380": 489,
  "3394": 490,
  "3395": 491,
  "3415": 492,
  "3429": 493,
  "3444": 494,
  "3458": 495,
  "3462": 496,
  "3496": 497,
  "3510": 498,
  "3516": 499,
  "3527": 500,
  "3543": 501,
  "3552": 502,
  "3557": 503,
  "3577": 504,
  "3614": 505,
  "3653": 506,
  "3678": 507,
  "3687": 508,
  "3703": 509,
  "3709": 510,
  "3714": 511,
  "3716": 512,
  "3721": 513,
  "3757": 514,
  "3781": 515,
  "3801": 516,
  "3817": 517,
  "3833": 518,
  "3841": 519,
  "3869": 520,
  "3900": 521,
  "3904": 522,
  "3913": 523,
  "3930": 524,
  "3935": 525,
  "3944": 526,
  "3963": 527,
  "3972": 528,
  "3993": 529,
  "4001": 530,
  "4014": 531,
  "4017": 532,
  "4042": 533,
  "4043": 534,
  "4046": 535,
  "4091": 536,
  "4093": 537,
  "4143": 538,
  "4225": 539,
  "4247": 540,
  "4256": 541,
  "4277": 542,
  "4289": 543,
  "4298": 544,
  "4305": 545,
  "4306": 546,
  "4317": 547,
  "4338": 548,
  "4353": 549,
  "4355": 550,
  "4371": 551,
  "4378": 552,
  "4381": 553,
  "4415": 554,
  "4422": 555,
  "4428": 556,
  "4443": 557,
  "4458": 558,
  "4502": 559,
  "4511": 560,
  "4541": 561,
  "4543": 562,
  "4581": 563,
  "4590": 564,
  "4637": 565,
  "4689": 566,
  "4692": 567,
  "4744": 568,
  "4749": 569,
  "4752": 570,
  "4763": 571,
  "4765": 572,
  "4781": 573,
  "4790": 574,
  "4798": 575,
  "4809": 576,
  "4824": 577,
  "4834": 578,
  "4849": 579,
  "4852": 580,
  "4861": 581,
  "4864": 582,
  "4865": 583,
  "4902": 584,
  "4915": 585,
  "4917": 586,
  "4919": 587,
  "4930": 588,
  "4988": 589,
  "5048": 590,
  "5066": 591,
  "5169": 592,
  "5171": 593,
  "5276": 594,
  "5347": 595,
  "5362": 596,
  "5392": 597,
  "5477": 598,
  "5481": 599,
  "5512": 600,
  "5518": 601,
  "5526": 602,
  "5531": 603,
  "5541": 604,
  "5554": 605,
  "5589": 606,
  "5607": 607,
  "5615": 608,
  "5634": 609,
  "5641": 610,
  "5642": 611,
  "5670": 612,
  "5682": 613,
  "5697": 614,
  "5717": 615,
  "5724": 616,
  "5730": 617,
  "5770": 618,
  "5794": 619,
  "5801": 620,
  "5807": 621,
  "5808": 622,
  "5866": 623,
  "5868": 624,
  "5898": 625,
  "5919": 626,
  "5933": 627,
  "6000": 628,
  "6027": 629,
  "6033": 630,
  "6034": 631,
  "6091": 632,
  "6132": 633,
  "6133": 634,
  "6155": 635,
  "6179": 636,
  "6217": 637,
  "6225": 638,
  "6233": 639,
  "6252": 640,
  "6263": 641,
  "6292": 642,
  "6312": 643,
  "6316": 644,
  "6317": 645,
  "6347": 646,
  "6348": 647,
  "6369": 648,
  "6388": 649,
  "6417": 650,
  "6442": 651,
  "6449": 652,
  "6465": 653,
  "6489": 654,
  "6491": 655,
  "6526": 656,
  "6573": 657,
  "6590": 658,
  "6630": 659,
  "6632": 660,
  "6634": 661,
  "6697": 662,
  "6713": 663,
  "6723": 664,
  "6729": 665,
  "6730": 666,
  "6733": 667,
  "6741": 668,
  "6754": 669,
  "6792": 670,
  "6802": 671,
  "6822": 672,
  "6863": 673,
  "6864": 674,
  "6902": 675,
  "6926": 676,
  "6960": 677,
  "6993": 678,
  "7003": 679,
  "7005": 680,
  "7063": 681,
  "7080": 682,
  "7138": 683,
  "7156": 684,
  "7198": 685,
  "7206": 686,
  "7251": 687,
  "7304": 688,
  "7317": 689,
  "7385": 690,
  "7404": 691,
  "7430": 692,
  "7453": 693,
  "7515": 694,
  "7561": 695,
  "7569": 696,
  "7631": 697,
  "7643": 698,
  "7669": 699,
  "7711": 700,
  "7828": 701,
  "7855": 702,
  "7857": 703,
  "7892": 704,
  "7912": 705,
  "7936": 706,
  "7942": 707,
  "7951": 708,
  "7962": 709,
  "7992": 710,
  "8039": 711,
  "8080": 712,
  "8112": 713,
  "8126": 714,
  "8136": 715,
  "8213": 716,
  "8261": 717,
  "8318": 718,
  "8326": 719,
  "8335": 720,
  "8348": 721,
  "8393": 722,
  "8424": 723,
  "8458": 724,
  "8464": 725,
  "8474": 726,
  "8492": 727,
  "8566": 728,
  "8568": 729,
  "8628": 730,
  "8629": 731,
  "8637": 732,
  "8723": 733,
  "8734": 734,
  "8747": 735,
  "8778": 736,
  "8811": 737,
  "8834": 738,
  "8846": 739,
  "8862": 740,
  "8869": 741,
  "8875": 742,
  "8890": 743,
  "8924": 744,
  "8938": 745,
  "8999": 746,
  "9004": 747,
  "9008": 748,
  "9011": 749,
  "9034": 750,
  "9043": 751,
  "9049": 752,
  "9110": 753,
  "9120": 754,
  "9157": 755,
  "9225": 756,
  "9231": 757,
  "9252": 758,
  "9279": 759,
  "9302": 760,
  "9345": 761,
  "9355": 762,
  "9465": 763,
  "9594": 764,
  "9652": 765,
  "9678": 766,
  "9700": 767,
  "9712": 768,
  "9769": 769,
  "9779": 770,
  "9781": 771,
  "9783": 772,
  "9839": 773,
  "9888": 774,
  "9943": 775,
  "9955": 776,
  "10006": 777,
  "10025": 778,
  "10036": 779,
  "10065": 780,
  "10071": 781,
  "10072": 782,
  "10073": 783,
  "10079": 784,
  "10097": 785,
  "10098": 786,
  "10126": 787,
  "10184": 788,
  "10216": 789,
  "10219": 790,
  "10237": 791,
  "10317": 792,
  "10333": 793,
  "10337": 794,
  "10400": 795,
  "10415": 796,
  "10444": 797,
  "10484": 798,
  "10540": 799,
  "10567": 800,
  "10574": 801,
  "10594": 802,
  "10599": 803,
  "10609": 804,
  "10628": 805,
  "10649": 806,
  "10696": 807,
  "10732": 808,
  "10737": 809,
  "10746": 810,
  "10759": 811,
  "10804": 812,
  "10832": 813,
  "10872": 814,
  "10878": 815,
  "10900": 816,
  "10946": 817,
  "10994": 818,
  "11081": 819,
  "11091": 820,
  "11148": 821,
  "11222": 822,
  "11269": 823,
  "11277": 824,
  "11280": 825,
  "11283": 826,
  "11354": 827,
  "11369": 828,
  "11403": 829,
  "11490": 830,
  "11506": 831,
  "11620": 832,
  "11639": 833,
  "11707": 834,
  "11715": 835,
  "11733": 836,
  "11741": 837,
  "11750": 838,
  "11752": 839,
  "11810": 840,
  "11866": 841,
  "11885": 842,
  "11932": 843,
  "12021": 844,
  "12052": 845,
  "12077": 846,
  "12151": 847,
  "12155": 848,
  "12158": 849,
  "12215": 850,
  "12252": 851,
  "12260": 852,
  "12271": 853,
  "12273": 854,
  "12296": 855,
  "12328": 856,
  "12345": 857,
  "12359": 858,
  "12414": 859,
  "12440": 860,
  "12489": 861,
  "12603": 862,
  "12635": 863,
  "12674": 864,
  "12694": 865,
  "12708": 866,
  "12714": 867,
  "12723": 868,
  "12748": 869,
  "12791": 870,
  "12812": 871,
  "12821": 872,
  "12826": 873,
  "12941": 874,
  "12949": 875,
  "13033": 876,
  "13042": 877,
  "13057": 878,
  "13066": 879,
  "13088": 880,
  "13102": 881,
  "13140": 882,
  "13213": 883,
  "13264": 884,
  "13279": 885,
  "13387": 886,
  "13389": 887,
  "13458": 888,
  "13462": 889,
  "13510": 890,
  "13532": 891,
  "13559": 892,
  "13583": 893,
  "13645": 894,
  "13713": 895,
  "13722": 896,
  "13785": 897,
  "13807": 898,
  "13811": 899,
  "13827": 900,
  "13859": 901,
  "13873": 902,
  "13884": 903,
  "13885": 904,
  "13910": 905,
  "13937": 906,
  "14080": 907,
  "14115": 908,
  "14140": 909,
  "14151": 910,
  "14172": 911,
  "14200": 912,
  "14210": 913,
  "14287": 914,
  "14295": 915,
  "14322": 916,
  "14379": 917,
  "14605": 918,
  "14606": 919,
  "14652": 920,
  "14720": 921,
  "14814": 922,
  "14949": 923,
  "15003": 924,
  "15008": 925,
  "15124": 926,
  "15190": 927,
  "15192": 928,
  "15252": 929,
  "15362": 930,
  "15377": 931,
  "15433": 932,
  "15462": 933,
  "15471": 934,
  "15473": 935,
  "15482": 936,
  "15540": 937,
  "15550": 938,
  "15570": 939,
  "15607": 940,
  "15627": 941,
  "15673": 942,
  "15677": 943,
  "15686": 944,
  "15715": 945,
  "15772": 946,
  "15790": 947,
  "15833": 948,
  "15869": 949,
  "15887": 950,
  "16080": 951,
  "16099": 952,
  "16128": 953,
  "16262": 954,
  "16279": 955,
  "16338": 956,
  "16382": 957,
  "16485": 958,
  "16501": 959,
  "16599": 960,
  "16798": 961,
  "16833": 962,
  "16869": 963,
  "16948": 964,
  "16960": 965,
  "16977": 966,
  "16985": 967,
  "17038": 968,
  "17060": 969,
  "17099": 970,
  "17106": 971,
  "17141": 972,
  "17194": 973,
  "17258": 974,
  "17270": 975,
  "17358": 976,
  "17449": 977,
  "17452": 978,
  "17514": 979,
  "17528": 980,
  "17567": 981,
  "17580": 982,
  "17606": 983,
  "17797": 984,
  "17930": 985,
  "17996": 986,
  "18071": 987,
  "18177": 988,
  "18190": 989,
  "18205": 990,
  "18249": 991,
  "18274": 992,
  "18291": 993,
  "18340": 994,
  "18405": 995,
  "18439": 996,
  "18448": 997,
  "18536": 998,
  "18541": 999,
  "18551": 1000,
  "18614": 1001,
  "18619": 1002,
  "18665": 1003,
  "18826": 1004,
  "18916": 1005,
  "18970": 1006,
  "19205": 1007,
  "19216": 1008,
  "19390": 1009,
  "19395": 1010,
  "19477": 1011,
  "19644": 1012,
  "19674": 1013,
  "19733": 1014,
  "19776": 1015,
  "19866": 1016,
  "19879": 1017,
  "19906": 1018,
  "19973": 1019,
  "20039": 1020,
  "20053": 1021,
  "20064": 1022,
  "20080": 1023,
  "20100": 1024,
  "20103": 1025,
  "20108": 1026,
  "20245": 1027,
  "20306": 1028,
  "20345": 1029,
  "20358": 1030,
  "20365": 1031,
  "20393": 1032,
  "20430": 1033,
  "20568": 1034,
  "20605": 1035,
  "20607": 1036,
  "20708": 1037,
  "20716": 1038,
  "20782": 1039,
  "20822": 1040,
  "20847": 1041,
  "21047": 1042,
  "21106": 1043,
  "21151": 1044,
  "21169": 1045,
  "21314": 1046,
  "21434": 1047,
  "21466": 1048,
  "21488": 1049,
  "21538": 1050,
  "21581": 1051,
  "21778": 1052,
  "21797": 1053,
  "21889": 1054,
  "21938": 1055,
  "22326": 1056,
  "22337": 1057,
  "22377": 1058,
  "22460": 1059,
  "22514": 1060,
  "22544": 1061,
  "22631": 1062,
  "22997": 1063,
  "23001": 1064,
  "23095": 1065,
  "23128": 1066,
  "23201": 1067,
  "23363": 1068,
  "23379": 1069,
  "23423": 1070,
  "23463": 1071,
  "23465": 1072,
  "23604": 1073,
  "23697": 1074,
  "23744": 1075,
  "24108": 1076,
  "24193": 1077,
  "24201": 1078,
  "24397": 1079,
  "24404": 1080,
  "24470": 1081,
  "24566": 1082,
  "24625": 1083,
  "24823": 1084,
  "24985": 1085,
  "24990": 1086,
  "25029": 1087,
  "25062": 1088,
  "25089": 1089,
  "25133": 1090,
  "25134": 1091,
  "25196": 1092,
  "25228": 1093,
  "25233": 1094,
  "25282": 1095,
  "25286": 1096,
  "25295": 1097,
  "25455": 1098,
  "25526": 1099,
  "25540": 1100,
  "25626": 1101,
  "25738": 1102,
  "25772": 1103,
  "25893": 1104,
  "25900": 1105,
  "25946": 1106,
  "25994": 1107,
  "26116": 1108,
  "26419": 1109,
  "26427": 1110,
  "26458": 1111,
  "26494": 1112,
  "26564": 1113,
  "26577": 1114,
  "26675": 1115,
  "26738": 1116,
  "26931": 1117,
  "26976": 1118,
  "26980": 1119,
  "27065": 1120,
  "27066": 1121,
  "27190": 1122,
  "27835": 1123,
  "27900": 1124,
  "27931": 1125,
  "27946": 1126,
  "27990": 1127,
  "28119": 1128,
  "28181": 1129,
  "28226": 1130,
  "28246": 1131,
  "28278": 1132,
  "28362": 1133,
  "28400": 1134,
  "28419": 1135,
  "28422": 1136,
  "28549": 1137,
  "28625": 1138,
  "28658": 1139,
  "28676": 1140,
  "28793": 1141,
  "28895": 1142,
  "28952": 1143,
  "28963": 1144,
  "29028": 1145,
  "29043": 1146,
  "29112": 1147,
  "29141": 1148,
  "29294": 1149,
  "29340": 1150,
  "29350": 1151,
  "29452": 1152,
  "29638": 1153,
  "29742": 1154,
  "29830": 1155,
  "29856": 1156,
  "29928": 1157,
  "29956": 1158,
  "29965": 1159,
  "30209": 1160,
  "30223": 1161,
  "30234": 1162,
  "30318": 1163,
  "30331": 1164,
  "30520": 1165,
  "30584": 1166,
  "30588": 1167,
  "30607": 1168,
  "30637": 1169,
  "30805": 1170,
  "30913": 1171,
  "31059": 1172,
  "31098": 1173,
  "31150": 1174,
  "31157": 1175,
  "31215": 1176,
  "31221": 1177,
  "31225": 1178,
  "31383": 1179,
  "31469": 1180,
  "31531": 1181,
  "31627": 1182,
  "31632": 1183,
  "31787": 1184,
  "31841": 1185,
  "31853": 1186,
  "31875": 1187,
  "31937": 1188,
  "31967": 1189,
  "32005": 1190,
  "32039": 1191,
  "32047": 1192,
  "32089": 1193,
  "32106": 1194,
  "32118": 1195,
  "32190": 1196,
  "32262": 1197,
  "32369": 1198,
  "32652": 1199,
  "32710": 1200,
  "32732": 1201,
  "32759": 1202,
  "32893": 1203,
  "32924": 1204,
  "33015": 1205,
  "33032": 1206,
  "33192": 1207,
  "33272": 1208,
  "33515": 1209,
  "33760": 1210,
  "33843": 1211,
  "33896": 1212,
  "33998": 1213,
  "34122": 1214,
  "34182": 1215,
  "34292": 1216,
  "34298": 1217,
  "34395": 1218,
  "34435": 1219,
  "34437": 1220,
  "34565": 1221,
  "34569": 1222,
  "34667": 1223,
  "34822": 1224,
  "34850": 1225,
  "34862": 1226,
  "34929": 1227,
  "35000": 1228,
  "35092": 1229,
  "35233": 1230,
  "35357": 1231,
  "35450": 1232,
  "35497": 1233,
  "35511": 1234,
  "35560": 1235,
  "36038": 1236,
  "36099": 1237,
  "36222": 1238,
  "36436": 1239,
  "36568": 1240,
  "36711": 1241,
  "36804": 1242,
  "36847": 1243,
  "36890": 1244,
  "37043": 1245,
  "37098": 1246,
  "37130": 1247,
  "37180": 1248,
  "37215": 1249,
  "37252": 1250,
  "37320": 1251,
  "37332": 1252,
  "37622": 1253,
  "37668": 1254,
  "37955": 1255,
  "38035": 1256,
  "38101": 1257,
  "38169": 1258,
  "38185": 1259,
  "38237": 1260,
  "38279": 1261,
  "38315": 1262,
  "38450": 1263,
  "38501": 1264,
  "38827": 1265,
  "38871": 1266,
  "38901": 1267,
  "39073": 1268,
  "39142": 1269,
  "39180": 1270,
  "39225": 1271,
  "39239": 1272,
  "39260": 1273,
  "39298": 1274,
  "39311": 1275,
  "39423": 1276,
  "39571": 1277,
  "39583": 1278,
  "39667": 1279,
  "39730": 1280,
  "39732": 1281,
  "39827": 1282,
  "39916": 1283,
  "39924": 1284,
  "39961": 1285,
  "39976": 1286,
  "39992": 1287,
  "40050": 1288,
  "40055": 1289,
  "40060": 1290,
  "40110": 1291,
  "40206": 1292,
  "40494": 1293,
  "40586": 1294,
  "40601": 1295,
  "40658": 1296,
  "40675": 1297,
  "40754": 1298,
  "40945": 1299,
  "40967": 1300,
  "40997": 1301,
  "41071": 1302,
  "41075": 1303,
  "41093": 1304,
  "41124": 1305,
  "41236": 1306,
  "41294": 1307,
  "41349": 1308,
  "41470": 1309,
  "41645": 1310,
  "41666": 1311,
  "41761": 1312,
  "41934": 1313,
  "42018": 1314,
  "42104": 1315,
  "42176": 1316,
  "42180": 1317,
  "42201": 1318,
  "42355": 1319,
  "42441": 1320,
  "42498": 1321,
  "42502": 1322,
  "42548": 1323,
  "42688": 1324,
  "42738": 1325,
  "42750": 1326,
  "42935": 1327,
  "43114": 1328,
  "43117": 1329,
  "43306": 1330,
  "43377": 1331,
  "43509": 1332,
  "43914": 1333,
  "44047": 1334,
  "44142": 1335,
  "44261": 1336,
  "44338": 1337,
  "44348": 1338,
  "44415": 1339,
  "44797": 1340,
  "44848": 1341,
  "44955": 1342,
  "45009": 1343,
  "45103": 1344,
  "45159": 1345,
  "45188": 1346,
  "45265": 1347,
  "45283": 1348,
  "45412": 1349,
  "45542": 1350,
  "45807": 1351,
  "45815": 1352,
  "45866": 1353,
  "45961": 1354,
  "46075": 1355,
  "46245": 1356,
  "46357": 1357,
  "46378": 1358,
  "46462": 1359,
  "46602": 1360,
  "46697": 1361,
  "46723": 1362,
  "46858": 1363,
  "46915": 1364,
  "47026": 1365,
  "47401": 1366,
  "47428": 1367,
  "47464": 1368,
  "47484": 1369,
  "47553": 1370,
  "47767": 1371,
  "47820": 1372,
  "47928": 1373,
  "48328": 1374,
  "48422": 1375,
  "48474": 1376,
  "48476": 1377,
  "48521": 1378,
  "48576": 1379,
  "48681": 1380,
  "48921": 1381,
  "48931": 1382,
  "49019": 1383,
  "49022": 1384,
  "49251": 1385,
  "49490": 1386,
  "49551": 1387,
  "49602": 1388,
  "49869": 1389,
  "49921": 1390,
  "49973": 1391,
  "50010": 1392,
  "50103": 1393,
  "50123": 1394,
  "50318": 1395,
  "50463": 1396,
  "50502": 1397,
  "50914": 1398,
  "50926": 1399,
  "51149": 1400,
  "51172": 1401,
  "51185": 1402,
  "51205": 1403,
  "51309": 1404,
  "51388": 1405,
  "51407": 1406,
  "51458": 1407,
  "52047": 1408,
  "52054": 1409,
  "52087": 1410,
  "52177": 1411,
  "52311": 1412,
  "52330": 1413,
  "52462": 1414,
  "52510": 1415,
  "52596": 1416,
  "52618": 1417,
  "52962": 1418,
  "53187": 1419,
  "53252": 1420,
  "53460": 1421,
  "53543": 1422,
  "53843": 1423,
  "53864": 1424,
  "53926": 1425,
  "53931": 1426,
  "53990": 1427,
  "54506": 1428,
  "54509": 1429,
  "54738": 1430,
  "54788": 1431,
  "54830": 1432,
  "54860": 1433,
  "55086": 1434,
  "55279": 1435,
  "55451": 1436,
  "55739": 1437,
  "55983": 1438,
  "56184": 1439,
  "56188": 1440,
  "56201": 1441,
  "56251": 1442,
  "56347": 1443,
  "56552": 1444,
  "56589": 1445,
  "56796": 1446,
  "56868": 1447,
  "56970": 1448,
  "57181": 1449,
  "57657": 1450,
  "57730": 1451,
  "57743": 1452,
  "57776": 1453,
  "57822": 1454,
  "57839": 1455,
  "57862": 1456,
  "57902": 1457,
  "58084": 1458,
  "58103": 1459,
  "58220": 1460,
  "58315": 1461,
  "58369": 1462,
  "58380": 1463,
  "58397": 1464,
  "58548": 1465,
  "58571": 1466,
  "58708": 1467,
  "58729": 1468,
  "58892": 1469,
  "58899": 1470,
  "58931": 1471,
  "59033": 1472,
  "59042": 1473,
  "59211": 1474,
  "59548": 1475,
  "59728": 1476,
  "59840": 1477,
  "59917": 1478,
  "59958": 1479,
  "60050": 1480,
  "60180": 1481,
  "60240": 1482,
  "60577": 1483,
  "60610": 1484,
  "60645": 1485,
  "60661": 1486,
  "60716": 1487,
  "60796": 1488,
  "60898": 1489,
  "61194": 1490,
  "61344": 1491,
  "61351": 1492,
  "61426": 1493,
  "61454": 1494,
  "61758": 1495,
  "62067": 1496,
  "62127": 1497,
  "62383": 1498,
  "62552": 1499,
  "62578": 1500,
  "62822": 1501,
  "63128": 1502,
  "63278": 1503,
  "63698": 1504,
  "63816": 1505,
  "63893": 1506,
  "63894": 1507,
  "63900": 1508,
  "63950": 1509,
  "64115": 1510,
  "64486": 1511,
  "64487": 1512,
  "64661": 1513,
  "64934": 1514,
  "64968": 1515,
  "65008": 1516,
  "65058": 1517,
  "65117": 1518,
  "65147": 1519,
  "65155": 1520,
  "65522": 1521,
  "65566": 1522,
  "65636": 1523,
  "65794": 1524,
  "65856": 1525,
  "66007": 1526,
  "66021": 1527,
  "66079": 1528,
  "66163": 1529,
  "66300": 1530,
  "66363": 1531,
  "66380": 1532,
  "66466": 1533,
  "66488": 1534,
  "66652": 1535,
  "66696": 1536,
  "66734": 1537,
  "66842": 1538,
  "66852": 1539,
  "66883": 1540,
  "66967": 1541,
  "66999": 1542,
  "67009": 1543,
  "67443": 1544,
  "67468": 1545,
  "67513": 1546,
  "67517": 1547,
  "67541": 1548,
  "67554": 1549,
  "67649": 1550,
  "67717": 1551,
  "67776": 1552,
  "67812": 1553,
  "68040": 1554,
  "68146": 1555,
  "68216": 1556,
  "68937": 1557,
  "69151": 1558,
  "69195": 1559,
  "69197": 1560,
  "69210": 1561,
  "69377": 1562,
  "69405": 1563,
  "69406": 1564,
  "69432": 1565,
  "69468": 1566,
  "69714": 1567,
  "69769": 1568,
  "70208": 1569,
  "70338": 1570,
  "70356": 1571,
  "70728": 1572,
  "70754": 1573,
  "70865": 1574,
  "70866": 1575,
  "71080": 1576,
  "71086": 1577,
  "71097": 1578,
  "71098": 1579,
  "71301": 1580,
  "71445": 1581,
  "71506": 1582,
  "71544": 1583,
  "71623": 1584,
  "71669": 1585,
  "71861": 1586,
  "71970": 1587,
  "72421": 1588,
  "72449": 1589,
  "72583": 1590,
  "72671": 1591,
  "72863": 1592,
  "73047": 1593,
  "73077": 1594,
  "73370": 1595,
  "73426": 1596,
  "73619": 1597,
  "73866": 1598,
  "73875": 1599,
  "73911": 1600,
  "74234": 1601,
  "75460": 1602,
  "75467": 1603,
  "75507": 1604,
  "75707": 1605,
  "75766": 1606,
  "75844": 1607,
  "75964": 1608,
  "76003": 1609,
  "76063": 1610,
  "76069": 1611,
  "76351": 1612,
  "76394": 1613,
  "76472": 1614,
  "76600": 1615,
  "76717": 1616,
  "76777": 1617,
  "76959": 1618,
  "77043": 1619,
  "77155": 1620,
  "77347": 1621,
  "77510": 1622,
  "77550": 1623,
  "77643": 1624,
  "77843": 1625,
  "78215": 1626,
  "78283": 1627,
  "78342": 1628,
  "78369": 1629,
  "78684": 1630,
  "78740": 1631,
  "79134": 1632,
  "79230": 1633,
  "79548": 1634,
  "79564": 1635,
  "79586": 1636,
  "79769": 1637,
  "79807": 1638,
  "79936": 1639,
  "80024": 1640,
  "80181": 1641,
  "80457": 1642,
  "80585": 1643,
  "80701": 1644,
  "81016": 1645,
  "81101": 1646,
  "81213": 1647,
  "81656": 1648,
  "81772": 1649,
  "82052": 1650,
  "82133": 1651,
  "82247": 1652,
  "82520": 1653,
  "82580": 1654,
  "82685": 1655,
  "82844": 1656,
  "82943": 1657,
  "83032": 1658,
  "83786": 1659,
  "83977": 1660,
  "84112": 1661,
  "84159": 1662,
  "84210": 1663,
  "84265": 1664,
  "84722": 1665,
  "85008": 1666,
  "85054": 1667,
  "85072": 1668,
  "85074": 1669,
  "85190": 1670,
  "85210": 1671,
  "85298": 1672,
  "85344": 1673,
  "85369": 1674,
  "85393": 1675,
  "85724": 1676,
  "85842": 1677,
  "85897": 1678,
  "86007": 1679,
  "86027": 1680,
  "86070": 1681,
  "86518": 1682,
  "86656": 1683,
  "86906": 1684,
  "87020": 1685,
  "87192": 1686,
  "87359": 1687,
  "87363": 1688,
  "87651": 1689,
  "87725": 1690,
  "87730": 1691,
  "87802": 1692,
  "88162": 1693,
  "88238": 1694,
  "88256": 1695,
  "88531": 1696,
  "88759": 1697,
  "89015": 1698,
  "89223": 1699,
  "89599": 1700,
  "90065": 1701,
  "90137": 1702,
  "90427": 1703,
  "90458": 1704,
  "90566": 1705,
  "90670": 1706,
  "90680": 1707,
  "90735": 1708,
  "90906": 1709,
  "91245": 1710,
  "91602": 1711,
  "91603": 1712,
  "91623": 1713,
  "91905": 1714,
  "91976": 1715,
  "92098": 1716,
  "92214": 1717,
  "92621": 1718,
  "92724": 1719,
  "92816": 1720,
  "93194": 1721,
  "93540": 1722,
  "94172": 1723,
  "94197": 1724,
  "94218": 1725,
  "94487": 1726,
  "94596": 1727,
  "94815": 1728,
  "94914": 1729,
  "95051": 1730,
  "95102": 1731,
  "95103": 1732,
  "95585": 1733,
  "95614": 1734,
  "95660": 1735,
  "95741": 1736,
  "95917": 1737,
  "96099": 1738,
  "96114": 1739,
  "96158": 1740,
  "96266": 1741,
  "96521": 1742,
  "96537": 1743,
  "96899": 1744,
  "97292": 1745,
  "97363": 1746,
  "97544": 1747,
  "97587": 1748,
  "97775": 1749,
  "97843": 1750,
  "97981": 1751,
  "97993": 1752,
  "98045": 1753,
  "98139": 1754,
  "98398": 1755,
  "98420": 1756,
  "98827": 1757,
  "98878": 1758,
  "98896": 1759,
  "99603": 1760,
  "99972": 1761,
  "<pad>": 0,
  "<sos>": 1,
  "<eos>": 2
}