{
  "11": 3,
  "12": 4,
  "13": 5,
  "64": 6,
  "65": 7,
  "66": 8,
  "67": 9,
  "68": 10,
  "69": 11,
  "70": 12,
  "71": 13,
  "72": 14,
  "73": 15,
  "75": 16,
  "76": 17,
  "77": 18,
  "78": 19,
  "79": 20,
  "81": 21,
  "82": 22,
  "83": 23,
  "84": 24,
  "85": 25,
  "87": 26,
  "89": 27,
  "258": 28,
  "259": 29,
  "263": 30,
  "264": 31,
  "265": 32,
  "266": 33,
  "267": 34,
  "268": 35,
  "269": 36,
  "272": 37,
  "273": 38,
  "274": 39,
  "275": 40,
  "276": 41,
  "277": 42,
  "278": 43,
  "281": 44,
  "282": 45,
  "285": 46,
  "288": 47,
  "291": 48,
  "292": 49,
  "293": 50,
  "294": 51,
  "295": 52,
  "296": 53,
  "297": 54,
  "299": 55,
  "300": 56,
  "301": 57,
  "303": 58,
  "304": 59,
  "305": 60,
  "306": 61,
  "308": 62,
  "309": 63,
  "311": 64,
  "312": 65,
  "316": 66,
  "318": 67,
  "320": 68,
  "321": 69,
  "323": 70,
  "324": 71,
  "325": 72,
  "326": 73,
  "327": 74,
  "329": 75,
  "331": 76,
  "332": 77,
  "336": 78,
  "337": 79,
  "342": 80,
  "343": 81,
  "344": 82,
  "346": 83,
  "347": 84,
  "348": 85,
  "349": 86,
  "351": 87,
  "354": 88,
  "355": 89,
  "359": 90,
  "360": 91,
  "361": 92,
  "369": 93,
  "370": 94,
  "372": 95,
  "373": 96,
  "374": 97,
  "375": 98,
  "376": 99,
  "380": 100,
  "383": 101,
  "384": 102,
  "385": 103,
  "387": 104,
  "388": 105,
  "390": 106,
  "391": 107,
  "395": 108,
  "396": 109,
  "402": 110,
  "403": 111,
  "404": 112,
  "408": 113,
  "409": 114,
  "414": 115,
  "417": 116,
  "424": 117,
  "428": 118,
  "436": 119,
  "437": 120,
  "438": 121,
  "439": 122,
  "444": 123,
  "447": 124,
  "450": 125,
  "451": 126,
  "453": 127,
  "454": 128,
  "459": 129,
  "460": 130,
  "461": 131,
  "462": 132,
  "463": 133,
  "466": 134,
  "470": 135,
  "472": 136,
  "478": 137,
  "483": 138,
  "485": 139,
  "490": 140,
  "496": 141,
  "501": 142,
  "503": 143,
  "506": 144,
  "511": 145,
  "513": 146,
  "514": 147,
  "519": 148,
  "520": 149,
  "521": 150,
  "523": 151,
  "525": 152,
  "531": 153,
  "537": 154,
  "539": 155,
  "540": 156,
  "541": 157,
  "546": 158,
  "548": 159,
  "550": 160,
  "554": 161,
  "566": 162,
  "569": 163,
  "575": 164,
  "579": 165,
  "580": 166,
  "581": 167,
  "582": 168,
  "588": 169,
  "592": 170,
  "593": 171,
  "594": 172,
  "603": 173,
  "613": 174,
  "614": 175,
  "628": 176,
  "630": 177,
  "635": 178,
  "638": 179,
  "648": 180,
  "649": 181,
  "651": 182,
  "653": 183,
  "655": 184,
  "656": 185,
  "664": 186,
  "665": 187,
  "668": 188,
  "671": 189,
  "676": 190,
  "677": 191,
  "687": 192,
  "688": 193,
  "689": 194,
  "708": 195,
  "710": 196,
  "712": 197,
  "713": 198,
  "716": 199,
  "729": 200,
  "737": 201,
  "738": 202,
  "743": 203,
  "749": 204,
  "751": 205,
  "754": 206,
  "757": 207,
  "762": 208,
  "778": 209,
  "779": 210,
  "782": 211,
  "784": 212,
  "797": 213,
  "799": 214,
  "802": 215,
  "805": 216,
  "809": 217,
  "818": 218,
  "822": 219,
  "830": 220,
  "831": 221,
  "834": 222,
  "840": 223,
  "846": 224,
  "857": 225,
  "864": 226,
  "865": 227,
  "867": 228,
  "880": 229,
  "884": 230,
  "893": 231,
  "896": 232,
  "899": 233,
  "911": 234,
  "912": 235,
  "924": 236,
  "934": 237,
  "936": 238,
  "938": 239,
  "940": 240,
  "944": 241,
  "945": 242,
  "951": 243,
  "953": 244,
  "958": 245,
  "959": 246,
  "967": 247,
  "969": 248,
  "971": 249,
  "978": 250,
  "981": 251,
  "983": 252,
  "991": 253,
  "992": 254,
  "998": 255,
  "1007": 256,
  "1008": 257,
  "1022": 258,
  "1028": 259,
  "1030": 260,
  "1031": 261,
  "1037": 262,
  "1040": 263,
  "1048": 264,
  "1052": 265,
  "1069": 266,
  "1072": 267,
  "1080": 268,
  "1082": 269,
  "1083": 270,
  "1089": 271,
  "1097": 272,
  "1098": 273,
  "1099": 274,
  "1113": 275,
  "1116": 276,
  "1121": 277,
  "1126": 278,
  "1138": 279,
  "1149": 280,
  "1157": 281,
  "1166": 282,
  "1169": 283,
  "1172": 284,
  "1189": 285,
  "1195": 286,
  "1206": 287,
  "1213": 288,
  "1218": 289,
  "1224": 290,
  "1237": 291,
  "1239": 292,
  "1263": 293,
  "1279": 294,
  "1280": 295,
  "1295": 296,
  "1296": 297,
  "1299": 298,
  "1317": 299,
  "1321": 300,
  "1323": 301,
  "1327": 302,
  "1331": 303,
  "1332": 304,
  "1342": 305,
  "1347": 306,
  "1355": 307,
  "1367": 308,
  "1370": 309,
  "1376": 310,
  "1380": 311,
  "1391": 312,
  "1394": 313,
  "1395": 314,
  "1400": 315,
  "1421": 316,
  "1437": 317,
  "1446": 318,
  "1448": 319,
  "1466": 320,
  "1469": 321,
  "1474": 322,
  "1485": 323,
  "1499": 324,
  "1501": 325,
  "1517": 326,
  "1522": 327,
  "1529": 328,
  "1540": 329,
  "1543": 330,
  "1557": 331,
  "1558": 332,
  "1560": 333,
  "1564": 334,
  "1589": 335,
  "1592": 336,
  "1601": 337,
  "1604": 338,
  "1610": 339,
  "1612": 340,
  "1624": 341,
  "1645": 342,
  "1646": 343,
  "1652": 344,
  "1658": 345,
  "1662": 346,
  "1665": 347,
  "1678": 348,
  "1685": 349,
  "1709": 350,
  "1744": 351,
  "1762": 352,
  "1764": 353,
  "1768": 354,
  "1773": 355,
  "1794": 356,
  "1826": 357,
  "1832": 358,
  "1841": 359,
  "1860": 360,
  "1864": 361,
  "1867": 362,
  "1871": 363,
  "1880": 364,
  "1897": 365,
  "1922": 366,
  "1955": 367,
  "1962": 368,
  "1964": 369,
  "1978": 370,
  "1989": 371,
  "1995": 372,
  "2000": 373,
  "2016": 374,
  "2041": 375,
  "2047": 376,
  "2067": 377,
  "2068": 378,
  "2070": 379,
  "2092": 380,
  "2099": 381,
  "2106": 382,
  "2107": 383,
  "2117": 384,
  "2119": 385,
  "2145": 386,
  "2159": 387,
  "2171": 388,
  "2172": 389,
  "2177": 390,
  "2200": 391,
  "2201": 392,
  "2215": 393,
  "2223": 394,
  "2227": 395,
  "2252": 396,
  "2254": 397,
  "2259": 398,
  "2269": 399,
  "2295": 400,
  "2308": 401,
  "2322": 402,
  "2347": 403,
  "2385": 404,
  "2389": 405,
  "2392": 406,
  "2423": 407,
  "2442": 408,
  "2445": 409,
  "2473": 410,
  "2480": 411,
  "2483": 412,
  "2486": 413,
  "2497": 414,
  "2512": 415,
  "2558": 416,
  "2579": 417,
  "2605": 418,
  "2629": 419,
  "2642": 420,
  "2649": 421,
  "2679": 422,
  "2700": 423,
  "2709": 424,
  "2727": 425,
  "2739": 426,
  "2749": 427,
  "2751": 428,
  "2762": 429,
  "2807": 430,
  "2827": 431,
  "2836": 432,
  "2840": 433,
  "2852": 434,
  "2853": 435,
  "2854": 436,
  "2910": 437,
  "2917": 438,
  "2960": 439,
  "2961": 440,
  "2967": 441,
  "2979": 442,
  "2995": 443,
  "3026": 444,
  "3055": 445,
  "3067": 446,
  "3074": 447,
  "3078": 448,
  "3091": 449,
  "3105": 450,
  "3117": 451,
  "3127": 452,
  "3197": 453,
  "3209": 454,
  "3212": 455,
  "3213": 456,
  "3223": 457,
  "3237": 458,
  "3276": 459,
  "3282": 460,
  "3289": 461,
  "3315": 462,
  "3326": 463,
  "3352": 464,
  "3375": 465,
  "3394": 466,
  "3395": 467,
  "3415": 468,
  "3429": 469,
  "3444": 470,
  "3496": 471,
  "3497": 472,
  "3510": 473,
  "3512": 474,
  "3521": 475,
  "3527": 476,
  "3528": 477,
  "3536": 478,
  "3557": 479,
  "3567": 480,
  "3609": 481,
  "3614": 482,
  "3635": 483,
  "3667": 484,
  "3678": 485,
  "3687": 486,
  "3689": 487,
  "3698": 488,
  "3703": 489,
  "3714": 490,
  "3716": 491,
  "3769": 492,
  "3833": 493,
  "3841": 494,
  "3846": 495,
  "3887": 496,
  "3904": 497,
  "3913": 498,
  "3920": 499,
  "3935": 500,
  "3969": 501,
  "3972": 502,
  "4039": 503,
  "4042": 504,
  "4046": 505,
  "4057": 506,
  "4087": 507,
  "4247": 508,
  "4298": 509,
  "4306": 510,
  "4317": 511,
  "4319": 512,
  "4338": 513,
  "4371": 514,
  "4378": 515,
  "4381": 516,
  "4406": 517,
  "4411": 518,
  "4415": 519,
  "4428": 520,
  "4433": 521,
  "4457": 522,
  "4458": 523,
  "4528": 524,
  "4543": 525,
  "4545": 526,
  "4547": 527,
  "4581": 528,
  "4590": 529,
  "4633": 530,
  "4634": 531,
  "4637": 532,
  "4647": 533,
  "4669": 534,
  "4675": 535,
  "4692": 536,
  "4704": 537,
  "4744": 538,
  "4749": 539,
  "4766": 540,
  "4781": 541,
  "4849": 542,
  "4902": 543,
  "4915": 544,
  "4917": 545,
  "4919": 546,
  "4941": 547,
  "4988": 548,
  "5048": 549,
  "5066": 550,
  "5169": 551,
  "5171": 552,
  "5178": 553,
  "5208": 554,
  "5276": 555,
  "5308": 556,
  "5320": 557,
  "5325": 558,
  "5335": 559,
  "5347": 560,
  "5362": 561,
  "5367": 562,
  "5389": 563,
  "5477": 564,
  "5485": 565,
  "5512": 566,
  "5518": 567,
  "5531": 568,
  "5541": 569,
  "5554": 570,
  "5615": 571,
  "5641": 572,
  "5642": 573,
  "5670": 574,
  "5682": 575,
  "5724": 576,
  "5730": 577,
  "5770": 578,
  "5797": 579,
  "5801": 580,
  "5808": 581,
  "5919": 582,
  "6000": 583,
  "6027": 584,
  "6033": 585,
  "6091": 586,
  "6133": 587,
  "6181": 588,
  "6200": 589,
  "6216": 590,
  "6217": 591,
  "6225": 592,
  "6229": 593,
  "6252": 594,
  "6263": 595,
  "6292": 596,
  "6293": 597,
  "6316": 598,
  "6321": 599,
  "6347": 600,
  "6348": 601,
  "6388": 602,
  "6489": 603,
  "6491": 604,
  "6519": 605,
  "6526": 606,
  "6632": 607,
  "6697": 608,
  "6723": 609,
  "6730": 610,
  "6733": 611,
  "6747": 612,
  "6754": 613,
  "6792": 614,
  "6824": 615,
  "6885": 616,
  "6902": 617,
  "6916": 618,
  "6960": 619,
  "6962": 620,
  "6987": 621,
  "6993": 622,
  "7005": 623,
  "7006": 624,
  "7018": 625,
  "7063": 626,
  "7138": 627,
  "7143": 628,
  "7164": 629,
  "7206": 630,
  "7210": 631,
  "7304": 632,
  "7363": 633,
  "7385": 634,
  "7453": 635,
  "7495": 636,
  "7515": 637,
  "7528": 638,
  "7710": 639,
  "7835": 640,
  "7836": 641,
  "7870": 642,
  "7893": 643,
  "7962": 644,
  "7992": 645,
  "8083": 646,
  "8110": 647,
  "8112": 648,
  "8122": 649,
  "8126": 650,
  "8136": 651,
  "8186": 652,
  "8213": 653,
  "8249": 654,
  "8393": 655,
  "8407": 656,
  "8424": 657,
  "8458": 658,
  "8481": 659,
  "8536": 660,
  "8566": 661,
  "8568": 662,
  "8629": 663,
  "8733": 664,
  "8747": 665,
  "8770": 666,
  "8778": 667,
  "8783": 668,
  "8801": 669,
  "8811": 670,
  "8835": 671,
  "8862": 672,
  "8869": 673,
  "8890": 674,
  "8938": 675,
  "9004": 676,
  "9008": 677,
  "9011": 678,
  "9048": 679,
  "9110": 680,
  "9120": 681,
  "9157": 682,
  "9225": 683,
  "9252": 684,
  "9355": 685,
  "9427": 686,
  "9465": 687,
  "9466": 688,
  "9511": 689,
  "9594": 690,
  "9630": 691,
  "9637": 692,
  "9652": 693,
  "9686": 694,
  "9700": 695,
  "9730": 696,
  "9769": 697,
  "9831": 698,
  "9988": 699,
  "10024": 700,
  "10025": 701,
  "10045": 702,
  "10071": 703,
  "10073": 704,
  "10084": 705,
  "10097": 706,
  "10098": 707,
  "10126": 708,
  "10194": 709,
  "10216": 710,
  "10253": 711,
  "10274": 712,
  "10317": 713,
  "10333": 714,
  "10337": 715,
  "10444": 716,
  "10478": 717,
  "10484": 718,
  "10524": 719,
  "10540": 720,
  "10574": 721,
  "10581": 722,
  "10609": 723,
  "10628": 724,
  "10649": 725,
  "10672": 726,
  "10696": 727,
  "10727": 728,
  "10728": 729,
  "10732": 730,
  "10737": 731,
  "10746": 732,
  "10773": 733,
  "10776": 734,
  "10832": 735,
  "10900": 736,
  "10910": 737,
  "10946": 738,
  "10994": 739,
  "11015": 740,
  "11091": 741,
  "11222": 742,
  "11249": 743,
  "11269": 744,
  "11280": 745,
  "11305": 746,
  "11354": 747,
  "11368": 748,
  "11369": 749,
  "11388": 750,
  "11403": 751,
  "11594": 752,
  "11620": 753,
  "11707": 754,
  "11715": 755,
  "11752": 756,
  "11810": 757,
  "11814": 758,
  "11857": 759,
  "11860": 760,
  "11885": 761,
  "12052": 762,
  "12077": 763,
  "12108": 764,
  "12134": 765,
  "12155": 766,
  "12183": 767,
  "12260": 768,
  "12341": 769,
  "12440": 770,
  "12489": 771,
  "12635": 772,
  "12646": 773,
  "12674": 774,
  "12717": 775,
  "12812": 776,
  "12821": 777,
  "12826": 778,
  "12997": 779,
  "13028": 780,
  "13081": 781,
  "13095": 782,
  "13102": 783,
  "13115": 784,
  "13140": 785,
  "13154": 786,
  "13178": 787,
  "13264": 788,
  "13279": 789,
  "13387": 790,
  "13441": 791,
  "13493": 792,
  "13510": 793,
  "13559": 794,
  "13576": 795,
  "13616": 796,
  "13645": 797,
  "13652": 798,
  "13827": 799,
  "13910": 800,
  "14080": 801,
  "14107": 802,
  "14113": 803,
  "14122": 804,
  "14151": 805,
  "14210": 806,
  "14287": 807,
  "14448": 808,
  "14605": 809,
  "14606": 810,
  "14609": 811,
  "14635": 812,
  "14720": 813,
  "14746": 814,
  "14796": 815,
  "14949": 816,
  "15003": 817,
  "15104": 818,
  "15184": 819,
  "15190": 820,
  "15192": 821,
  "15222": 822,
  "15279": 823,
  "15286": 824,
  "15362": 825,
  "15377": 826,
  "15433": 827,
  "15462": 828,
  "15482": 829,
  "15601": 830,
  "15607": 831,
  "15627": 832,
  "15715": 833,
  "15769": 834,
  "15772": 835,
  "15887": 836,
  "15938": 837,
  "15959": 838,
  "15962": 839,
  "16080": 840,
  "16262": 841,
  "16338": 842,
  "16339": 843,
  "16382": 844,
  "16697": 845,
  "16711": 846,
  "16833": 847,
  "16845": 848,
  "16869": 849,
  "16903": 850,
  "16915": 851,
  "16948": 852,
  "16960": 853,
  "16977": 854,
  "17028": 855,
  "17060": 856,
  "17105": 857,
  "17187": 858,
  "17251": 859,
  "17258": 860,
  "17270": 861,
  "17358": 862,
  "17392": 863,
  "17434": 864,
  "17449": 865,
  "17452": 866,
  "17514": 867,
  "17544": 868,
  "17580": 869,
  "17606": 870,
  "17684": 871,
  "17757": 872,
  "17797": 873,
  "17872": 874,
  "17930": 875,
  "17996": 876,
  "18205": 877,
  "18274": 878,
  "18316": 879,
  "18439": 880,
  "18525": 881,
  "18536": 882,
  "18541": 883,
  "18595": 884,
  "18619": 885,
  "18638": 886,
  "18680": 887,
  "18812": 888,
  "18931": 889,
  "18970": 890,
  "19031": 891,
  "19067": 892,
  "19126": 893,
  "19216": 894,
  "19227": 895,
  "19290": 896,
  "19329": 897,
  "19394": 898,
  "19540": 899,
  "19733": 900,
  "19736": 901,
  "19776": 902,
  "19866": 903,
  "19907": 904,
  "19972": 905,
  "20053": 906,
  "20100": 907,
  "20103": 908,
  "20108": 909,
  "20110": 910,
  "20233": 911,
  "20243": 912,
  "20245": 913,
  "20358": 914,
  "20370": 915,
  "20393": 916,
  "20399": 917,
  "20531": 918,
  "20568": 919,
  "20605": 920,
  "20607": 921,
  "20708": 922,
  "20735": 923,
  "20822": 924,
  "21047": 925,
  "21075": 926,
  "21143": 927,
  "21152": 928,
  "21200": 929,
  "21434": 930,
  "21519": 931,
  "21538": 932,
  "21830": 933,
  "21887": 934,
  "21920": 935,
  "21946": 936,
  "22059": 937,
  "22377": 938,
  "22460": 939,
  "22514": 940,
  "22544": 941,
  "22631": 942,
  "22711": 943,
  "22997": 944,
  "23095": 945,
  "23114": 946,
  "23135": 947,
  "23254": 948,
  "23423": 949,
  "23553": 950,
  "23576": 951,
  "23577": 952,
  "23637": 953,
  "23671": 954,
  "23697": 955,
  "23774": 956,
  "23834": 957,
  "24108": 958,
  "24201": 959,
  "24301": 960,
  "24409": 961,
  "24470": 962,
  "24520": 963,
  "24614": 964,
  "24625": 965,
  "24705": 966,
  "24823": 967,
  "25075": 968,
  "25088": 969,
  "25089": 970,
  "25098": 971,
  "25155": 972,
  "25160": 973,
  "25196": 974,
  "25228": 975,
  "25282": 976,
  "25286": 977,
  "25295": 978,
  "25356": 979,
  "25455": 980,
  "25526": 981,
  "25540": 982,
  "25568": 983,
  "25626": 984,
  "25632": 985,
  "25738": 986,
  "25746": 987,
  "25985": 988,
  "25994": 989,
  "26047": 990,
  "26205": 991,
  "26407": 992,
  "26414": 993,
  "26419": 994,
  "26427": 995,
  "26458": 996,
  "26483": 997,
  "26494": 998,
  "26514": 999,
  "26577": 1000,
  "26675": 1001,
  "26931": 1002,
  "27190": 1003,
  "27282": 1004,
  "27417": 1005,
  "27428": 1006,
  "27578": 1007,
  "27835": 1008,
  "27843": 1009,
  "27845": 1010,
  "27865": 1011,
  "27990": 1012,
  "28029": 1013,
  "28043": 1014,
  "28119": 1015,
  "28246": 1016,
  "28256": 1017,
  "28344": 1018,
  "28400": 1019,
  "28625": 1020,
  "28639": 1021,
  "28658": 1022,
  "28676": 1023,
  "28705": 1024,
  "28787": 1025,
  "28793": 1026,
  "28900": 1027,
  "28963": 1028,
  "29008": 1029,
  "29028": 1030,
  "29045": 1031,
  "29141": 1032,
  "29294": 1033,
  "29350": 1034,
  "29413": 1035,
  "29465": 1036,
  "29511": 1037,
  "29856": 1038,
  "29876": 1039,
  "29928": 1040,
  "29956": 1041,
  "29963": 1042,
  "30149": 1043,
  "30223": 1044,
  "30234": 1045,
  "30331": 1046,
  "30477": 1047,
  "30528": 1048,
  "30540": 1049,
  "30607": 1050,
  "30710": 1051,
  "30805": 1052,
  "31157": 1053,
  "31225": 1054,
  "31311": 1055,
  "31349": 1056,
  "31469": 1057,
  "31531": 1058,
  "31548": 1059,
  "31674": 1060,
  "31853": 1061,
  "31952": 1062,
  "31967": 1063,
  "32190": 1064,
  "32314": 1065,
  "32710": 1066,
  "32752": 1067,
  "32759": 1068,
  "32850": 1069,
  "32878": 1070,
  "33015": 1071,
  "33192": 1072,
  "33397": 1073,
  "33515": 1074,
  "33823": 1075,
  "33853": 1076,
  "33896": 1077,
  "34081": 1078,
  "34152": 1079,
  "34182": 1080,
  "34435": 1081,
  "34437": 1082,
  "34565": 1083,
  "34815": 1084,
  "34822": 1085,
  "34830": 1086,
  "34850": 1087,
  "34860": 1088,
  "34928": 1089,
  "35010": 1090,
  "35150": 1091,
  "35220": 1092,
  "35450": 1093,
  "35497": 1094,
  "35560": 1095,
  "35662": 1096,
  "35785": 1097,
  "35838": 1098,
  "35853": 1099,
  "35904": 1100,
  "36099": 1101,
  "36436": 1102,
  "36444": 1103,
  "36643": 1104,
  "36890": 1105,
  "37017": 1106,
  "37111": 1107,
  "37232": 1108,
  "37244": 1109,
  "37511": 1110,
  "37547": 1111,
  "37930": 1112,
  "38101": 1113,
  "38169": 1114,
  "38185": 1115,
  "38279": 1116,
  "38415": 1117,
  "38610": 1118,
  "38639": 1119,
  "38812": 1120,
  "38828": 1121,
  "38893": 1122,
  "39036": 1123,
  "39073": 1124,
  "39112": 1125,
  "39124": 1126,
  "39180": 1127,
  "39225": 1128,
  "39294": 1129,
  "39298": 1130,
  "39311": 1131,
  "39451": 1132,
  "39583": 1133,
  "39667": 1134,
  "39710": 1135,
  "39830": 1136,
  "39944": 1137,
  "39961": 1138,
  "39992": 1139,
  "40055": 1140,
  "40110": 1141,
  "40492": 1142,
  "40625": 1143,
  "40860": 1144,
  "40945": 1145,
  "40967": 1146,
  "41071": 1147,
  "41093": 1148,
  "41236": 1149,
  "41278": 1150,
  "41305": 1151,
  "41376": 1152,
  "41625": 1153,
  "41664": 1154,
  "41921": 1155,
  "41934": 1156,
  "41967": 1157,
  "41987": 1158,
  "42441": 1159,
  "42502": 1160,
  "42657": 1161,
  "42723": 1162,
  "42750": 1163,
  "42935": 1164,
  "43014": 1165,
  "43222": 1166,
  "43296": 1167,
  "43301": 1168,
  "44190": 1169,
  "44338": 1170,
  "44415": 1171,
  "44469": 1172,
  "44545": 1173,
  "44554": 1174,
  "44750": 1175,
  "44797": 1176,
  "44906": 1177,
  "45009": 1178,
  "45103": 1179,
  "45111": 1180,
  "45168": 1181,
  "45558": 1182,
  "45866": 1183,
  "45876": 1184,
  "45961": 1185,
  "46245": 1186,
  "46429": 1187,
  "46494": 1188,
  "46591": 1189,
  "46931": 1190,
  "47015": 1191,
  "47026": 1192,
  "47178": 1193,
  "47206": 1194,
  "47484": 1195,
  "47535": 1196,
  "47615": 1197,
  "47767": 1198,
  "47820": 1199,
  "47822": 1200,
  "48000": 1201,
  "48067": 1202,
  "48328": 1203,
  "48416": 1204,
  "48454": 1205,
  "48850": 1206,
  "48931": 1207,
  "48999": 1208,
  "49236": 1209,
  "49551": 1210,
  "49591": 1211,
  "49602": 1212,
  "50010": 1213,
  "50103": 1214,
  "50502": 1215,
  "50914": 1216,
  "51205": 1217,
  "51441": 1218,
  "51526": 1219,
  "51737": 1220,
  "52087": 1221,
  "52311": 1222,
  "52330": 1223,
  "52360": 1224,
  "52462": 1225,
  "52596": 1226,
  "52603": 1227,
  "52762": 1228,
  "52777": 1229,
  "52962": 1230,
  "53187": 1231,
  "53358": 1232,
  "53377": 1233,
  "53403": 1234,
  "53543": 1235,
  "53565": 1236,
  "53696": 1237,
  "53722": 1238,
  "53902": 1239,
  "53990": 1240,
  "54097": 1241,
  "54176": 1242,
  "54266": 1243,
  "54272": 1244,
  "54485": 1245,
  "54681": 1246,
  "54776": 1247,
  "54788": 1248,
  "54860": 1249,
  "54921": 1250,
  "55002": 1251,
  "55122": 1252,
  "55271": 1253,
  "55279": 1254,
  "55300": 1255,
  "55424": 1256,
  "55451": 1257,
  "55672": 1258,
  "55779": 1259,
  "55862": 1260,
  "55880": 1261,
  "56094": 1262,
  "56099": 1263,
  "56184": 1264,
  "56246": 1265,
  "56503": 1266,
  "56528": 1267,
  "56552": 1268,
  "56589": 1269,
  "56692": 1270,
  "56809": 1271,
  "56868": 1272,
  "56970": 1273,
  "57258": 1274,
  "57730": 1275,
  "57766": 1276,
  "57839": 1277,
  "57973": 1278,
  "58132": 1279,
  "58147": 1280,
  "58197": 1281,
  "58315": 1282,
  "58369": 1283,
  "58576": 1284,
  "58633": 1285,
  "58708": 1286,
  "58899": 1287,
  "59004": 1288,
  "59042": 1289,
  "59548": 1290,
  "60024": 1291,
  "60050": 1292,
  "60477": 1293,
  "60577": 1294,
  "61194": 1295,
  "61344": 1296,
  "61353": 1297,
  "61387": 1298,
  "61454": 1299,
  "61745": 1300,
  "62067": 1301,
  "62090": 1302,
  "62344": 1303,
  "62444": 1304,
  "62552": 1305,
  "62822": 1306,
  "63099": 1307,
  "63278": 1308,
  "63340": 1309,
  "63423": 1310,
  "63698": 1311,
  "64032": 1312,
  "64099": 1313,
  "64115": 1314,
  "64200": 1315,
  "64281": 1316,
  "64345": 1317,
  "64487": 1318,
  "64753": 1319,
  "64934": 1320,
  "65166": 1321,
  "65856": 1322,
  "66163": 1323,
  "66652": 1324,
  "66696": 1325,
  "66780": 1326,
  "66815": 1327,
  "66842": 1328,
  "66852": 1329,
  "66999": 1330,
  "67100": 1331,
  "67443": 1332,
  "67554": 1333,
  "67717": 1334,
  "68146": 1335,
  "68151": 1336,
  "68330": 1337,
  "68396": 1338,
  "68593": 1339,
  "68669": 1340,
  "68817": 1341,
  "69034": 1342,
  "69239": 1343,
  "69406": 1344,
  "69407": 1345,
  "69432": 1346,
  "69578": 1347,
  "69694": 1348,
  "69814": 1349,
  "69947": 1350,
  "70138": 1351,
  "70257": 1352,
  "70338": 1353,
  "70383": 1354,
  "70437": 1355,
  "70854": 1356,
  "70865": 1357,
  "70866": 1358,
  "71097": 1359,
  "71253": 1360,
  "71296": 1361,
  "71398": 1362,
  "71437": 1363,
  "71544": 1364,
  "71629": 1365,
  "71826": 1366,
  "72239": 1367,
  "72343": 1368,
  "72390": 1369,
  "72583": 1370,
  "72628": 1371,
  "73077": 1372,
  "73225": 1373,
  "73512": 1374,
  "73663": 1375,
  "73866": 1376,
  "73875": 1377,
  "73911": 1378,
  "73990": 1379,
  "74261": 1380,
  "74772": 1381,
  "74961": 1382,
  "75288": 1383,
  "75401": 1384,
  "75707": 1385,
  "75802": 1386,
  "75878": 1387,
  "76063": 1388,
  "76111": 1389,
  "76181": 1390,
  "76351": 1391,
  "76535": 1392,
  "76777": 1393,
  "76871": 1394,
  "77155": 1395,
  "77467": 1396,
  "77507": 1397,
  "77510": 1398,
  "77643": 1399,
  "78418": 1400,
  "78428": 1401,
  "78540": 1402,
  "78810": 1403,
  "78968": 1404,
  "79020": 1405,
  "79212": 1406,
  "79444": 1407,
  "79807": 1408,
  "79835": 1409,
  "80024": 1410,
  "80457": 1411,
  "80701": 1412,
  "80990": 1413,
  "81585": 1414,
  "81772": 1415,
  "81807": 1416,
  "82036": 1417,
  "82123": 1418,
  "82200": 1419,
  "82629": 1420,
  "82649": 1421,
  "82863": 1422,
  "83450": 1423,
  "83571": 1424,
  "83595": 1425,
  "83921": 1426,
  "83937": 1427,
  "83977": 1428,
  "84112": 1429,
  "84189": 1430,
  "84767": 1431,
  "84807": 1432,
  "84820": 1433,
  "85210": 1434,
  "85298": 1435,
  "85369": 1436,
  "85428": 1437,
  "85530": 1438,
  "85677": 1439,
  "85724": 1440,
  "85920": 1441,
  "86084": 1442,
  "86400": 1443,
  "86518": 1444,
  "86627": 1445,
  "86656": 1446,
  "86906": 1447,
  "87034": 1448,
  "87099": 1449,
  "87120": 1450,
  "87197": 1451,
  "87200": 1452,
  "87251": 1453,
  "87512": 1454,
  "87556": 1455,
  "87685": 1456,
  "87730": 1457,
  "87770": 1458,
  "87780": 1459,
  "87802": 1460,
  "87909": 1461,
  "87996": 1462,
  "88256": 1463,
  "88295": 1464,
  "88531": 1465,
  "89049": 1466,
  "89129": 1467,
  "89615": 1468,
  "90065": 1469,
  "90099": 1470,
  "90539": 1471,
  "90745": 1472,
  "90818": 1473,
  "91010": 1474,
  "91065": 1475,
  "91427": 1476,
  "91905": 1477,
  "92347": 1478,
  "92510": 1479,
  "92644": 1480,
  "92816": 1481,
  "92835": 1482,
  "93471": 1483,
  "93540": 1484,
  "94381": 1485,
  "94487": 1486,
  "94913": 1487,
  "95102": 1488,
  "95524": 1489,
  "95531": 1490,
  "95557": 1491,
  "95614": 1492,
  "95741": 1493,
  "95952": 1494,
  "95954": 1495,
  "96099": 1496,
  "96146": 1497,
  "96266": 1498,
  "96488": 1499,
  "96521": 1500,
  "96772": 1501,
  "96899": 1502,
  "97183": 1503,
  "97219": 1504,
  "97253": 1505,
  "97306": 1506,
  "97378": 1507,
  "97587": 1508,
  "97668": 1509,
  "97686": 1510,
  "97775": 1511,
  "97800": 1512,
  "97809": 1513,
  "97914": 1514,
  "97998": 1515,
  "98040": 1516,
  "98398": 1517,
  "98443": 1518,
  "98485": 1519,
  "98765": 1520,
  "98878": 1521,
  "99156": 1522,
  "99540": 1523,
  "99603": 1524,
  "99633": 1525,
  "99954": 1526,
  "99972": 1527,
  "100127": 1528,
  "<pad>": 0,
  "<sos>": 1,
  "<eos>": 2
}